{
  "activation_type": "silu",
  "alibi": false,
  "alibi_bias_max": 8.0,
  "architectures": [
    "LLaDAModelLM"
  ],
  "attention_dropout": 0.0,
  "attention_layer_norm": false,
  "attention_layer_norm_with_affine": true,
  "auto_map": {
    "AutoConfig": "configuration_llada.LLaDAConfig",
    "AutoModelForCausalLM": "modeling_llada.LLaDAModelLM",
    "AutoModel": "modeling_llada.LLaDAModelLM"
  },
  "bias_for_layer_norm": false,
  "block_group_size": 1,
  "block_type": "llama",
  "d_model": 4096,
  "embedding_dropout": 0.0,
  "embedding_size": 126464,
  "eos_token_id": 126081,
  "flash_attention": true,
  "flash_attention_version": "3",
  "include_bias": false,
  "include_qkv_bias": false,
  "init_cutoff_factor": null,
  "init_device": "meta",
  "init_fn": "mitchell",
  "init_std": 0.02,
  "input_emb_norm": false,
  "layer_norm_type": "rms",
  "layer_norm_with_affine": true,
  "mask_token_id": 126336,
  "max_sequence_length": 8192,
  "mlp_hidden_size": 12288,
  "mlp_ratio": 4,
  "model_type": "llada",
  "multi_query_attention": null,
  "n_heads": 32,
  "n_kv_heads": 32,
  "n_layers": 32,
  "pad_token_id": 126081,
  "precision": "amp_bf16",
  "residual_dropout": 0.0,
  "rms_norm_eps": 1e-05,
  "rope": false,
  "rope_full_precision": false,
  "rope_theta": 500000.0,
  "scale_logits": false,
  "transformers_version": "4.46.3",
  "use_cache": true,
  "vocab_size": 126464,
  "weight_tying": false,
  "yarn": true,
  "yarn_scale": 1.0,
  "yarn_original_max_position_embeddings": 4096,
  "yarn_extrapolation_factor": 1.0,
  "yarn_attn_factor": 1.0,
  "yarn_beta_fast": 1.0,
  "yarn_beta_slow": 32.0
}